; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	satellite3 - satellite
	instrument8 - instrument
	instrument9 - instrument
	satellite4 - satellite
	instrument10 - instrument
	instrument11 - instrument
	spectrograph4 - mode
	thermograph5 - mode
	infrared1 - mode
	thermograph7 - mode
	thermograph3 - mode
	thermograph6 - mode
	thermograph2 - mode
	thermograph0 - mode
	Star3 - direction
	GroundStation2 - direction
	Star4 - direction
	Star1 - direction
	Star0 - direction
	Planet5 - direction
	Star6 - direction
	Phenomenon7 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Phenomenon10 - direction
)
(:init
	(supports instrument0 thermograph6)
	(calibration_target instrument0 Star4)
	(supports instrument1 thermograph6)
	(supports instrument1 thermograph2)
	(calibration_target instrument1 Star3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon10)
	(supports instrument2 thermograph5)
	(supports instrument2 thermograph3)
	(supports instrument2 thermograph2)
	(calibration_target instrument2 GroundStation2)
	(supports instrument3 infrared1)
	(supports instrument3 thermograph7)
	(calibration_target instrument3 Star3)
	(supports instrument4 thermograph6)
	(supports instrument4 spectrograph4)
	(supports instrument4 thermograph7)
	(calibration_target instrument4 Star4)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet5)
	(supports instrument5 thermograph7)
	(supports instrument5 thermograph3)
	(supports instrument5 spectrograph4)
	(calibration_target instrument5 GroundStation2)
	(supports instrument6 thermograph3)
	(calibration_target instrument6 GroundStation2)
	(supports instrument7 thermograph0)
	(supports instrument7 thermograph2)
	(calibration_target instrument7 Star4)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star4)
	(supports instrument8 thermograph0)
	(calibration_target instrument8 GroundStation2)
	(supports instrument9 spectrograph4)
	(calibration_target instrument9 Star4)
	(on_board instrument8 satellite3)
	(on_board instrument9 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon9)
	(supports instrument10 spectrograph4)
	(calibration_target instrument10 Star1)
	(supports instrument11 thermograph6)
	(supports instrument11 thermograph2)
	(calibration_target instrument11 Star0)
	(on_board instrument10 satellite4)
	(on_board instrument11 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Planet5)
)
(:goal (and
	(pointing satellite1 Phenomenon7)
	(pointing satellite2 Star4)
	(pointing satellite3 Planet8)
	(have_image Planet5 spectrograph4)
	(have_image Planet5 thermograph5)
	(have_image Star6 thermograph6)
	(have_image Phenomenon7 infrared1)
	(have_image Phenomenon7 thermograph2)
	(have_image Planet8 thermograph0)
	(have_image Phenomenon9 thermograph2)
	(have_image Phenomenon9 thermograph6)
	(have_image Phenomenon10 thermograph2)
	(have_image Phenomenon10 thermograph7)
))

)

; plan
1. (turn_to satellite3 groundstation2 phenomenon9)
   deleted: (pointing satellite3 phenomenon9)
   added: (pointing satellite3 groundstation2)
   goals met: 1 of 13
2. (turn_to satellite1 star4 planet5)
   deleted: (pointing satellite1 planet5)
   added: (pointing satellite1 star4)
   goals met: 1 of 13
3. (switch_on instrument4 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument4)
   goals met: 1 of 13
4. (calibrate satellite1 instrument4 star4)
   added: (calibrated instrument4)
   goals met: 1 of 13
5. (turn_to satellite1 star6 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 star6)
   goals met: 1 of 13
6. (take_image satellite1 star6 instrument4 thermograph6)
   added: (have_image star6 thermograph6)
   goals met: 2 of 13
7. (turn_to satellite1 planet5 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 planet5)
   goals met: 2 of 13
8. (take_image satellite1 planet5 instrument4 spectrograph4)
   added: (have_image planet5 spectrograph4)
   goals met: 3 of 13
9. (turn_to satellite1 phenomenon9 planet5)
   deleted: (pointing satellite1 planet5)
   added: (pointing satellite1 phenomenon9)
   goals met: 3 of 13
10. (take_image satellite1 phenomenon9 instrument4 thermograph6)
   added: (have_image phenomenon9 thermograph6)
   goals met: 4 of 13
11. (turn_to satellite1 phenomenon10 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 phenomenon10)
   goals met: 4 of 13
12. (take_image satellite1 phenomenon10 instrument4 thermograph7)
   added: (have_image phenomenon10 thermograph7)
   goals met: 5 of 13
13. (turn_to satellite1 groundstation2 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 groundstation2)
   goals met: 5 of 13
14. (switch_on instrument8 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument8)
   goals met: 5 of 13
15. (switch_off instrument4 satellite1)
   deleted: (power_on instrument4)
   added: (power_avail satellite1)
   goals met: 5 of 13
16. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 5 of 13
17. (calibrate satellite1 instrument2 groundstation2)
   added: (calibrated instrument2)
   goals met: 5 of 13
18. (calibrate satellite3 instrument8 groundstation2)
   added: (calibrated instrument8)
   goals met: 5 of 13
19. (turn_to satellite1 phenomenon10 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 phenomenon10)
   goals met: 5 of 13
20. (take_image satellite1 phenomenon10 instrument2 thermograph2)
   added: (have_image phenomenon10 thermograph2)
   goals met: 6 of 13
21. (turn_to satellite1 phenomenon7 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 phenomenon7)
   goals met: 7 of 13
22. (take_image satellite1 phenomenon7 instrument2 thermograph2)
   added: (have_image phenomenon7 thermograph2)
   goals met: 8 of 13
23. (turn_to satellite1 phenomenon9 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 phenomenon9)
   goals met: 7 of 13
24. (take_image satellite1 phenomenon9 instrument2 thermograph2)
   added: (have_image phenomenon9 thermograph2)
   goals met: 8 of 13
25. (turn_to satellite1 planet5 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 planet5)
   goals met: 8 of 13
26. (take_image satellite1 planet5 instrument2 thermograph5)
   added: (have_image planet5 thermograph5)
   goals met: 9 of 13
27. (switch_off instrument2 satellite1)
   deleted: (power_on instrument2)
   added: (power_avail satellite1)
   goals met: 9 of 13
28. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 9 of 13
29. (turn_to satellite1 star3 planet5)
   deleted: (pointing satellite1 planet5)
   added: (pointing satellite1 star3)
   goals met: 9 of 13
30. (calibrate satellite1 instrument3 star3)
   added: (calibrated instrument3)
   goals met: 9 of 13
31. (turn_to satellite1 phenomenon7 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 phenomenon7)
   goals met: 10 of 13
32. (take_image satellite1 phenomenon7 instrument3 infrared1)
   added: (have_image phenomenon7 infrared1)
   goals met: 11 of 13
33. (turn_to satellite3 planet8 groundstation2)
   deleted: (pointing satellite3 groundstation2)
   added: (pointing satellite3 planet8)
   goals met: 12 of 13
34. (take_image satellite3 planet8 instrument8 thermograph0)
   added: (have_image planet8 thermograph0)
   goals met: 13 of 13
